#### Terraform Plan 🤖 `data-services-test`
``` 35 to add, 0 to change, 0 to destroy.```
<details>
  <summary>
    Show Plan :
  </summary>

  ```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_project_iam_binding.dataflow_admin will be created
  + resource "google_project_iam_binding" "dataflow_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "projects/pa-cons-swe-de-2022-mll01"
      + role    = "roles/dataflow.admin"
    }

  # google_project_iam_binding.dataflow_worker will be created
  + resource "google_project_iam_binding" "dataflow_worker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "projects/pa-cons-swe-de-2022-mll01"
      + role    = "roles/dataflow.worker"
    }

  # google_project_iam_binding.pubsub_editor will be created
  + resource "google_project_iam_binding" "pubsub_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "projects/pa-cons-swe-de-2022-mll01"
      + role    = "roles/pubsub.editor"
    }

  # google_project_iam_binding.secretmanager_admin will be created
  + resource "google_project_iam_binding" "secretmanager_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "projects/pa-cons-swe-de-2022-mll01"
      + role    = "roles/secretmanager.admin"
    }

  # google_project_iam_member.svc_github_storage_admin will be created
  + resource "google_project_iam_member" "svc_github_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/pa-cons-swe-de-2022-mll01"
      + role    = "roles/storage.admin"
    }

  # google_project_service.dataflow_api will be created
  + resource "google_project_service" "dataflow_api" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "dataflow.googleapis.com"
    }

  # google_project_service.iam_api will be created
  + resource "google_project_service" "iam_api" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "iam.googleapis.com"
    }

  # google_service_account.svc_data_lake_producer will be created
  + resource "google_service_account" "svc_data_lake_producer" {
      + account_id = "svc-data-lake-producer"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_service_account.svc_dataflow_worker will be created
  + resource "google_service_account" "svc_dataflow_worker" {
      + account_id = "svc-dataflow-worker"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_service_account.svc_github_action_application_deployment will be created
  + resource "google_service_account" "svc_github_action_application_deployment" {
      + account_id = "svc-application-deployment"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # google_service_account_iam_binding.svc_dataflow_worker_user will be created
  + resource "google_service_account_iam_binding" "svc_dataflow_worker_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = (known after apply)
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.bucket_dataflow_temp.data.google_iam_policy.policy will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "policy"  {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
              + (known after apply),
            ]
          + role    = "roles/storage.objectAdmin"
        }
      + binding {
          + members = []
          + role    = "roles/storage.admin"
        }
      + binding {
          + members = []
          + role    = "roles/storage.objectViewer"
        }
    }

  # module.bucket_dataflow_temp.google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "pa-cons-swe-de-2022-mll01-dataflow-temp"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # module.bucket_dataflow_temp.google_storage_bucket_iam_policy.policy_mapping will be created
  + resource "google_storage_bucket_iam_policy" "policy_mapping" {
      + bucket      = "pa-cons-swe-de-2022-mll01-dataflow-temp"
      + etag        = (known after apply)
      + id          = (known after apply)
      + policy_data = (known after apply)
    }

  # module.data_pipeline.google_bigquery_dataset.datalake_dataset will be created
  + resource "google_bigquery_dataset" "datalake_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "data_lake_sysint"
      + delete_contents_on_destroy = false
      + description                = "Raw data from the Trustly data ingestion framework"
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "EU"
      + project                    = (known after apply)
      + self_link                  = (known after apply)

      + access {
          + domain         = (known after apply)
          + group_by_email = (known after apply)
          + role           = (known after apply)
          + special_group  = (known after apply)
          + user_by_email  = (known after apply)

          + dataset {
              + target_types = (known after apply)

              + dataset {
                  + dataset_id = (known after apply)
                  + project_id = (known after apply)
                }
            }

          + view {
              + dataset_id = (known after apply)
              + project_id = (known after apply)
              + table_id   = (known after apply)
            }
        }
    }

  # module.data_pipeline.google_bigquery_dataset_iam_binding.datalake_dataset_editor_binding will be created
  + resource "google_bigquery_dataset_iam_binding" "datalake_dataset_editor_binding" {
      + dataset_id = "data_lake_sysint"
      + etag       = (known after apply)
      + id         = (known after apply)
      + members    = (known after apply)
      + project    = (known after apply)
      + role       = "roles/bigquery.dataEditor"
    }

  # module.data_pipeline.google_bigquery_dataset_iam_binding.datalake_dataset_viewer_binding will be created
  + resource "google_bigquery_dataset_iam_binding" "datalake_dataset_viewer_binding" {
      + dataset_id = "data_lake_sysint"
      + etag       = (known after apply)
      + id         = (known after apply)
      + project    = (known after apply)
      + role       = "roles/bigquery.dataViewer"
    }

  # module.data_pipeline.google_compute_network.dataflow_network will be created
  + resource "google_compute_network" "dataflow_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "VPC network used for hosting Dataflow workers"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "dataflow-network"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.data_pipeline.google_compute_subnetwork.dataflow_subnetwork will be created
  + resource "google_compute_subnetwork" "dataflow_subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.1.0.0/20"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "dataflow-subnetwork"
      + network                    = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "europe-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # module.data_pipeline.google_project_iam_member.dataflow_worker will be created
  + resource "google_project_iam_member" "dataflow_worker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "projects/pa-cons-swe-de-2022-mll01"
      + role    = "roles/dataflow.worker"
    }

  # module.data_pipeline.google_pubsub_subscription.data_ingestion_subscription_avro_gcs will be created
  + resource "google_pubsub_subscription" "data_ingestion_subscription_avro_gcs" {
      + ack_deadline_seconds       = (known after apply)
      + enable_message_ordering    = false
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "beam-to-gcs"
      + project                    = (known after apply)
      + topic                      = "phoenix.analytics.avro"

      + expiration_policy {}
    }

  # module.data_pipeline.google_pubsub_subscription_iam_binding.phoenix_analytics_avro_beam_avro_gcs_subscriber will be created
  + resource "google_pubsub_subscription_iam_binding" "phoenix_analytics_avro_beam_avro_gcs_subscriber" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + members      = (known after apply)
      + project      = (known after apply)
      + role         = "roles/pubsub.subscriber"
      + subscription = (known after apply)
    }

  # module.data_pipeline.google_pubsub_subscription_iam_binding.phoenix_analytics_avro_beam_avro_gcs_viewer will be created
  + resource "google_pubsub_subscription_iam_binding" "phoenix_analytics_avro_beam_avro_gcs_viewer" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + members      = (known after apply)
      + project      = (known after apply)
      + role         = "roles/pubsub.viewer"
      + subscription = (known after apply)
    }

  # module.data_pipeline.google_pubsub_topic.data_ingestion_topic will be created
  + resource "google_pubsub_topic" "data_ingestion_topic" {
      + id      = (known after apply)
      + name    = "phoenix.analytics.avro"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.data_pipeline.google_pubsub_topic_iam_binding.publishers will be created
  + resource "google_pubsub_topic_iam_binding" "publishers" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = "phoenix.analytics.avro"
    }

  # module.data_pipeline.google_storage_bucket.dataflow_temp_bucket will be created
  + resource "google_storage_bucket" "dataflow_temp_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "pa-cons-swe-de-2022-mll01-dataflow-temp-sysint"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # module.data_pipeline.google_storage_bucket.datalake_avro_bucket will be created
  + resource "google_storage_bucket" "datalake_avro_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "pa-cons-swe-de-2022-mll01-data-lake-avro"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # module.data_pipeline.google_storage_bucket.schema_registry_bucket will be created
  + resource "google_storage_bucket" "schema_registry_bucket" {
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "pa-cons-swe-de-2022-mll01-avro-schema-store-sysint"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # module.data_pipeline.google_storage_bucket.unprocessed_bucket will be created
  + resource "google_storage_bucket" "unprocessed_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "pa-cons-swe-de-2022-mll01-beam-pubsub-unprocessed-sysint"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }
    }

  # module.data_pipeline.google_storage_bucket_iam_binding.dataflow_temp_bucket_object_admin_binding will be created
  + resource "google_storage_bucket_iam_binding" "dataflow_temp_bucket_object_admin_binding" {
      + bucket  = "pa-cons-swe-de-2022-mll01-dataflow-temp-sysint"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + role    = "roles/storage.objectAdmin"
    }

  # module.data_pipeline.google_storage_bucket_iam_binding.datalake_avro_bucket_viewer_binding will be created
  + resource "google_storage_bucket_iam_binding" "datalake_avro_bucket_viewer_binding" {
      + bucket = "pa-cons-swe-de-2022-mll01-data-lake-avro"
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.data_pipeline.google_storage_bucket_iam_binding.schema_registry_bucket_object_viewer_binding will be created
  + resource "google_storage_bucket_iam_binding" "schema_registry_bucket_object_viewer_binding" {
      + bucket  = "pa-cons-swe-de-2022-mll01-avro-schema-store-sysint"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + role    = "roles/storage.objectViewer"
    }

  # module.data_pipeline.google_storage_bucket_iam_binding.unprocessed_bucket_viewer_binding will be created
  + resource "google_storage_bucket_iam_binding" "unprocessed_bucket_viewer_binding" {
      + bucket = "pa-cons-swe-de-2022-mll01-beam-pubsub-unprocessed-sysint"
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.data_pipeline.google_storage_bucket_iam_member.datalake_avro_bucket_object_admin will be created
  + resource "google_storage_bucket_iam_member" "datalake_avro_bucket_object_admin" {
      + bucket = "pa-cons-swe-de-2022-mll01-data-lake-avro"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.data_pipeline.google_storage_bucket_iam_member.schema_registry_bucket_object_admin will be created
  + resource "google_storage_bucket_iam_member" "schema_registry_bucket_object_admin" {
      + bucket = "pa-cons-swe-de-2022-mll01-avro-schema-store-sysint"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.data_pipeline.google_storage_bucket_iam_member.unprocessed_bucket_object_admin will be created
  + resource "google_storage_bucket_iam_member" "unprocessed_bucket_object_admin" {
      + bucket = "pa-cons-swe-de-2022-mll01-beam-pubsub-unprocessed-sysint"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

Plan: 35 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @marioloera, Action: `pull_request`, Status: `success`*